In [7]:
import numpy as np 
import pandas as pd
df = pd.read_csv("D:\\PYTHON FULL STACK\\LibraryPrograms\\Pandas\\DATAFRAME\\studentmarks.csv")
print(df)
print("*"*80)

    htno     name  telugu  english  hindi  maths  science  social
0    100   Ramesh      50       60     66     98       66      55
1    101   Rajesh      45       67     34     67       66      78
2    102   Rossum      56       88     56     99       44      77
3    103     Raji      56       78     34     56       88      55
4    104   Kalyan      51       63     62     93       67      51
5    105  Karthik      48       62     39     68       65      88
6    106   Kambli      53       81     59     92       48      73
7    107  Praveen      46       88     74     86       78      45
8    108   Ganesh      53       62     76     88       76      35
9    109     Nags      55       77     44     77       86      58
10   110    Biswa      66       48     86     95       48      47
11   111   Ritchi      66       68     64     76       98      75
12   104   Kalyan      51       63     62     93       67      51
13   112  shareef      50       63     99     90       76      67
14   113     sonu      60       89     98     87       77      68
15   114   Rajesh      45       67     77     55       66      46
16   115   Rakesh      67       78     88     78       67      49
********************************************************************************

In [12]:
import numpy as np 
import pandas as pd
df = pd.read_csv("D:\\PYTHON FULL STACK\\LibraryPrograms\\Pandas\\DATAFRAME\\studentmarks.csv")
print(df)
print("*"*80)

    htno     name  telugu  english  hindi  maths  science  social
0    100   Ramesh      50       60     66     98       66      55
1    101   Rajesh      45       67     34     67       66      78
2    102   Rossum      56       88     56     99       44      77
3    103     Raji      56       78     34     56       88      55
4    104   Kalyan      51       63     62     93       67      51
5    105  Karthik      48       62     39     68       65      88
6    106   Kambli      53       81     59     92       48      73
7    107  Praveen      46       88     74     86       78      45
8    108   Ganesh      53       62     76     88       76      35
9    109     Nags      55       77     44     77       86      58
10   110    Biswa      66       48     86     95       48      47
11   111   Ritchi      66       68     64     76       98      75
12   104   Kalyan      51       63     62     93       67      51
13   112  shareef      50       63     99     90       76      67
14   113     sonu      60       89     98     87       77      68
15   114   Rajesh      45       67     77     55       66      46
16   115   Rakesh      67       78     88     78       67      49
********************************************************************************

In [6]:
#get the name and there marks
df["name"]

0      Ramesh
1      Rajesh
2      Rossum
3        Raji
4      Kalyan
5     Karthik
6      Kambli
7     Praveen
8      Ganesh
9        Nags
10      Biswa
11     Ritchi
12     Kalyan
13    shareef
14       sonu
15     Rajesh
16     Rakesh
Name: name, dtype: object

In [ ]:
#  Multiple Series of record 
df[["name","maths"]]   #this is for multiple record into  the table

       name  maths
0    Ramesh     98
1    Rajesh     67
2    Rossum     99
3      Raji     56
4    Kalyan     93
5   Karthik     68
6    Kambli     92
7   Praveen     86
8    Ganesh     88
9      Nags     77
10    Biswa     95
11   Ritchi     76
12   Kalyan     93
13  shareef     90
14     sonu     87
15   Rajesh     55
16   Rakesh     78

In [31]:
df[["name","maths"]][4:9]

      name  maths
4   Kalyan     93
5  Karthik     68
6   Kambli     92
7  Praveen     86
8   Ganesh     88

In [17]:
df[4:9][["name","maths"]]

      name  maths
4   Kalyan     93
5  Karthik     68
6   Kambli     92
7  Praveen     86
8   Ganesh     88

In [18]:
print(df)

    htno     name  telugu  english  hindi  maths  science  social
0    100   Ramesh      50       60     66     98       66      55
1    101   Rajesh      45       67     34     67       66      78
2    102   Rossum      56       88     56     99       44      77
3    103     Raji      56       78     34     56       88      55
4    104   Kalyan      51       63     62     93       67      51
5    105  Karthik      48       62     39     68       65      88
6    106   Kambli      53       81     59     92       48      73
7    107  Praveen      46       88     74     86       78      45
8    108   Ganesh      53       62     76     88       76      35
9    109     Nags      55       77     44     77       86      58
10   110    Biswa      66       48     86     95       48      47
11   111   Ritchi      66       68     64     76       98      75
12   104   Kalyan      51       63     62     93       67      51
13   112  shareef      50       63     99     90       76      67
14   113     sonu      60       89     98     87       77      68
15   114   Rajesh      45       67     77     55       66      46
16   115   Rakesh      67       78     88     78       67      49

In [19]:
#get the alternative record into it
print(df[::2][["name","maths"]])

      name  maths
0   Ramesh     98
2   Rossum     99
4   Kalyan     93
6   Kambli     92
8   Ganesh     88
10   Biswa     95
12  Kalyan     93
14    sonu     87
16  Rakesh     78

In [20]:
#get the ODD record into it
print(df[1::2][["name","maths"]])

       name  maths
1    Rajesh     67
3      Raji     56
5   Karthik     68
7   Praveen     86
9      Nags     77
11   Ritchi     76
13  shareef     90
15   Rajesh     55

In [22]:
# df[[2,6,1][::]]

In [23]:
# Accessing the data from dataFrame part -2 with the use of loc[] and iloc[] Attribute
print(df)

    htno     name  telugu  english  hindi  maths  science  social
0    100   Ramesh      50       60     66     98       66      55
1    101   Rajesh      45       67     34     67       66      78
2    102   Rossum      56       88     56     99       44      77
3    103     Raji      56       78     34     56       88      55
4    104   Kalyan      51       63     62     93       67      51
5    105  Karthik      48       62     39     68       65      88
6    106   Kambli      53       81     59     92       48      73
7    107  Praveen      46       88     74     86       78      45
8    108   Ganesh      53       62     76     88       76      35
9    109     Nags      55       77     44     77       86      58
10   110    Biswa      66       48     86     95       48      47
11   111   Ritchi      66       68     64     76       98      75
12   104   Kalyan      51       63     62     93       67      51
13   112  shareef      50       63     99     90       76      67
14   113     sonu      60       89     98     87       77      68
15   114   Rajesh      45       67     77     55       66      46
16   115   Rakesh      67       78     88     78       67      49

In [13]:
#Get 7 record  By using loc[]
print(df.loc[7])

htno           107
name       Praveen
telugu          46
english         88
hindi           74
maths           86
science         78
social          45
Name: 7, dtype: object

In [25]:
print(df.loc[7]["name"])

Praveen

In [ ]:
df.loc[7,["name"]]  # DataFrameobj.loc[row,[columnname]]

name    Praveen
Name: 7, dtype: object

In [28]:
df.loc[10]

htno         110
name       Biswa
telugu        66
english       48
hindi         86
maths         95
science       48
social        47
Name: 10, dtype: object

In [19]:
print(df.loc[14,["name"]])

name    sonu
Name: 14, dtype: object

In [24]:
# print(df.loc[10])
#  i want 14 record name 
df.loc[14,["name"]]

name    sonu
Name: 14, dtype: object

In [28]:
# get 10 Recordname and maths marks 
df.loc[14,][["name","maths"]]

name     sonu
maths      87
Name: 14, dtype: object

In [31]:
# get 10 Record name and maths marks  and social
df.loc[10][["name","maths","social"]]

name      Biswa
maths        95
social       47
Name: 10, dtype: object

In [32]:
df.loc[10][["htno","name","maths","social"]]

htno        110
name      Biswa
maths        95
social       47
Name: 10, dtype: object

In [36]:
#  Appling the slicing Operation by using loc[]df.loc
#  Get the record from 3 to 6
df.loc[3:6]

   htno     name  telugu  english  hindi  maths  science  social
3   103     Raji      56       78     34     56       88      55
4   104   Kalyan      51       63     62     93       67      51
5   105  Karthik      48       62     39     68       65      88
6   106   Kambli      53       81     59     92       48      73

In [38]:
# Get the Record from 10 to last
df.loc[10:]

    htno     name  telugu  english  hindi  maths  science  social
10   110    Biswa      66       48     86     95       48      47
11   111   Ritchi      66       68     64     76       98      75
12   104   Kalyan      51       63     62     93       67      51
13   112  shareef      50       63     99     90       76      67
14   113     sonu      60       89     98     87       77      68
15   114   Rajesh      45       67     77     55       66      46
16   115   Rakesh      67       78     88     78       67      49

In [58]:
# #  Get the Record from 10 to last name and maths marks
# df.loc[10:][["name","maths"]]
df.loc[10:,["name","maths"]]

       name  maths
10    Biswa     95
11   Ritchi     76
12   Kalyan     93
13  shareef     90
14     sonu     87
15   Rajesh     55
16   Rakesh     78

In [59]:
print(df)

    htno     name  telugu  english  hindi  maths  science  social
0    100   Ramesh      50       60     66     98       66      55
1    101   Rajesh      45       67     34     67       66      78
2    102   Rossum      56       88     56     99       44      77
3    103     Raji      56       78     34     56       88      55
4    104   Kalyan      51       63     62     93       67      51
5    105  Karthik      48       62     39     68       65      88
6    106   Kambli      53       81     59     92       48      73
7    107  Praveen      46       88     74     86       78      45
8    108   Ganesh      53       62     76     88       76      35
9    109     Nags      55       77     44     77       86      58
10   110    Biswa      66       48     86     95       48      47
11   111   Ritchi      66       68     64     76       98      75
12   104   Kalyan      51       63     62     93       67      51
13   112  shareef      50       63     99     90       76      67
14   113     sonu      60       89     98     87       77      68
15   114   Rajesh      45       67     77     55       66      46
16   115   Rakesh      67       78     88     78       67      49

In [64]:
# By using loc[] display all  the  name of rows 
# df.loc[::,["name"]]
# df.loc[::1,["name"]]
df.loc[:,["name"]]

       name
0    Ramesh
1    Rajesh
2    Rossum
3      Raji
4    Kalyan
5   Karthik
6    Kambli
7   Praveen
8    Ganesh
9      Nags
10    Biswa
11   Ritchi
12   Kalyan
13  shareef
14     sonu
15   Rajesh
16   Rakesh

In [67]:
# How to finds number of names
df.loc[::,["name"]].count()

name    17
dtype: int64

In [68]:
df.loc[::,["name"]].size

17

In [ ]:

#! Get the Random record from DataFrame
df.loc[[1,6,9]]

   htno    name  telugu  english  hindi  maths  science  social
1   101  Rajesh      45       67     34     67       66      78
6   106  Kambli      53       81     59     92       48      73
9   109    Nags      55       77     44     77       86      58

In [72]:

#! get the random record record form DataFrame with Name ,Science and Maths
# df.loc[[1,6,9]][["name","science","maths"]]

#OR
df.loc[[1,6,9,],["name","science","maths"]]

     name  science  maths
1  Rajesh       66     67
6  Kambli       48     92
9    Nags       86     77

In [89]:

#!We want all record
# df.loc[::,::]  

#todo    ------or
# df.loc[::,::1]

# df.loc[::]

df.loc[::][::]

    htno     name  telugu  english  hindi  maths  science  social
0    100   Ramesh      50       60     66     98       66      55
1    101   Rajesh      45       67     34     67       66      78
2    102   Rossum      56       88     56     99       44      77
3    103     Raji      56       78     34     56       88      55
4    104   Kalyan      51       63     62     93       67      51
5    105  Karthik      48       62     39     68       65      88
6    106   Kambli      53       81     59     92       48      73
7    107  Praveen      46       88     74     86       78      45
8    108   Ganesh      53       62     76     88       76      35
9    109     Nags      55       77     44     77       86      58
10   110    Biswa      66       48     86     95       48      47
11   111   Ritchi      66       68     64     76       98      75
12   104   Kalyan      51       63     62     93       67      51
13   112  shareef      50       63     99     90       76      67
14   113     sonu      60       89     98     87       77      68
15   114   Rajesh      45       67     77     55       66      46
16   115   Rakesh      67       78     88     78       67      49

In [99]:

#! Get all the Record from dataFraame with Name to maths
df.loc[::,["name","telugu",	"english",	"hindi","maths"]]

       name  telugu  english  hindi  maths
0    Ramesh      50       60     66     98
1    Rajesh      45       67     34     67
2    Rossum      56       88     56     99
3      Raji      56       78     34     56
4    Kalyan      51       63     62     93
5   Karthik      48       62     39     68
6    Kambli      53       81     59     92
7   Praveen      46       88     74     86
8    Ganesh      53       62     76     88
9      Nags      55       77     44     77
10    Biswa      66       48     86     95
11   Ritchi      66       68     64     76
12   Kalyan      51       63     62     93
13  shareef      50       63     99     90
14     sonu      60       89     98     87
15   Rajesh      45       67     77     55
16   Rakesh      67       78     88     78

In [100]:

#todo ----------------Column slicing --------------------------------------
#! Get all the Record from dataFraame with Name to maths with column slicing 
df.loc[::,"name":"maths"]

       name  telugu  english  hindi  maths
0    Ramesh      50       60     66     98
1    Rajesh      45       67     34     67
2    Rossum      56       88     56     99
3      Raji      56       78     34     56
4    Kalyan      51       63     62     93
5   Karthik      48       62     39     68
6    Kambli      53       81     59     92
7   Praveen      46       88     74     86
8    Ganesh      53       62     76     88
9      Nags      55       77     44     77
10    Biswa      66       48     86     95
11   Ritchi      66       68     64     76
12   Kalyan      51       63     62     93
13  shareef      50       63     99     90
14     sonu      60       89     98     87
15   Rajesh      45       67     77     55
16   Rakesh      67       78     88     78

In [101]:

#! get all the Record from alternative from dataFrame with name to maths with column slicing
df.loc[::2,"name":"maths"]

      name  telugu  english  hindi  maths
0   Ramesh      50       60     66     98
2   Rossum      56       88     56     99
4   Kalyan      51       63     62     93
6   Kambli      53       81     59     92
8   Ganesh      53       62     76     88
10   Biswa      66       48     86     95
12  Kalyan      51       63     62     93
14    sonu      60       89     98     87
16  Rakesh      67       78     88     78

In [102]:

#! I want a alternative column 
df.loc[::,"name":"maths":2]

       name  english  maths
0    Ramesh       60     98
1    Rajesh       67     67
2    Rossum       88     99
3      Raji       78     56
4    Kalyan       63     93
5   Karthik       62     68
6    Kambli       81     92
7   Praveen       88     86
8    Ganesh       62     88
9      Nags       77     77
10    Biswa       48     95
11   Ritchi       68     76
12   Kalyan       63     93
13  shareef       63     90
14     sonu       89     87
15   Rajesh       67     55
16   Rakesh       78     78

In [103]:

#^===========================================================
#todo  ------iloc------------------------------
#^===========================================================
#! get the 13th record from DataFrame
df.iloc[13]

htno           112
name       shareef
telugu          50
english         63
hindi           99
maths           90
science         76
social          67
Name: 13, dtype: object

In [104]:
df.iloc[10]

htno         110
name       Biswa
telugu        66
english       48
hindi         86
maths         95
science       48
social        47
Name: 10, dtype: object

In [105]:

#! get 8,9,14 record from DataFrame 
#! it is Random redors from DataFrame
df.iloc[[8,9,14]]

    htno    name  telugu  english  hindi  maths  science  social
8    108  Ganesh      53       62     76     88       76      35
9    109    Nags      55       77     44     77       86      58
14   113    sonu      60       89     98     87       77      68

In [ ]:

#! get 3rd Record 
df.iloc[3]  #* we pass the index into it not Name of the column

htno        103
name       Raji
telugu       56
english      78
hindi        34
maths        56
science      88
social       55
Name: 3, dtype: object

In [ ]:

#! get 3rd Record name
#todo - First get the 3rd record and next find the name column index and put it
df.iloc[3,[1]]  #* we pass the index into it not Name of the column

name    Raji
Name: 3, dtype: object

In [109]:

#! get 3 record name ,maths ,science
df.iloc[3,[1,5,6]]

name       Raji
maths        56
science      88
Name: 3, dtype: object

In [ ]:

#! Get 3rd record to 6th record
df.iloc[3:7] #* last is Exclesive

   htno     name  telugu  english  hindi  maths  science  social
3   103     Raji      56       78     34     56       88      55
4   104   Kalyan      51       63     62     93       67      51
5   105  Karthik      48       62     39     68       65      88
6   106   Kambli      53       81     59     92       48      73

In [111]:

#! Get 3rd record to 6th record and we need name and social
df.iloc[3:7,[1,7]]

      name  social
3     Raji      55
4   Kalyan      51
5  Karthik      88
6   Kambli      73

In [113]:

#! Get 3rd record to 6th alternatively record and we need name and social 
df.iloc[3:7:2,[1,7]]

      name  social
3     Raji      55
5  Karthik      88

In [114]:

#! Get all Record from name and social
df.iloc[::,[1,7]]

       name  social
0    Ramesh      55
1    Rajesh      78
2    Rossum      77
3      Raji      55
4    Kalyan      51
5   Karthik      88
6    Kambli      73
7   Praveen      45
8    Ganesh      35
9      Nags      58
10    Biswa      47
11   Ritchi      75
12   Kalyan      51
13  shareef      67
14     sonu      68
15   Rajesh      46
16   Rakesh      49

In [117]:
df.iloc[::,1:7]

       name  telugu  english  hindi  maths  science
0    Ramesh      50       60     66     98       66
1    Rajesh      45       67     34     67       66
2    Rossum      56       88     56     99       44
3      Raji      56       78     34     56       88
4    Kalyan      51       63     62     93       67
5   Karthik      48       62     39     68       65
6    Kambli      53       81     59     92       48
7   Praveen      46       88     74     86       78
8    Ganesh      53       62     76     88       76
9      Nags      55       77     44     77       86
10    Biswa      66       48     86     95       48
11   Ritchi      66       68     64     76       98
12   Kalyan      51       63     62     93       67
13  shareef      50       63     99     90       76
14     sonu      60       89     98     87       77
15   Rajesh      45       67     77     55       66
16   Rakesh      67       78     88     78       67

In [120]:

#! get 3rd record to 6th record and Need 
df.iloc[::,1:7:2]

       name  english  maths
0    Ramesh       60     98
1    Rajesh       67     67
2    Rossum       88     99
3      Raji       78     56
4    Kalyan       63     93
5   Karthik       62     68
6    Kambli       81     92
7   Praveen       88     86
8    Ganesh       62     88
9      Nags       77     77
10    Biswa       48     95
11   Ritchi       68     76
12   Kalyan       63     93
13  shareef       63     90
14     sonu       89     87
15   Rajesh       67     55
16   Rakesh       78     78

In [ ]:

#todo =========================TODAY 20-02-2025=================================
#adding the data to the dataFrame
df["total"]=0
print(df)

    htno     name  telugu  english  hindi  maths  science  social  total
0    100   Ramesh      50       60     66     98       66      55      0
1    101   Rajesh      45       67     34     67       66      78      0
2    102   Rossum      56       88     56     99       44      77      0
3    103     Raji      56       78     34     56       88      55      0
4    104   Kalyan      51       63     62     93       67      51      0
5    105  Karthik      48       62     39     68       65      88      0
6    106   Kambli      53       81     59     92       48      73      0
7    107  Praveen      46       88     74     86       78      45      0
8    108   Ganesh      53       62     76     88       76      35      0
9    109     Nags      55       77     44     77       86      58      0
10   110    Biswa      66       48     86     95       48      47      0
11   111   Ritchi      66       68     64     76       98      75      0
12   104   Kalyan      51       63     62     93       67      51      0
13   112  shareef      50       63     99     90       76      67      0
14   113     sonu      60       89     98     87       77      68      0
15   114   Rajesh      45       67     77     55       66      46      0
16   115   Rakesh      67       78     88     78       67      49      0

In [ ]:
# df.iloc[::,[2]]
# df.loc[::,["telugu"]]
# df[::]["telugu"]

0     50
1     45
2     56
3     56
4     51
5     48
6     53
7     46
8     53
9     55
10    66
11    66
12    51
13    50
14    60
15    45
16    67
Name: telugu, dtype: int64

In [154]:
df["telugu"]

0     50
1     45
2     56
3     56
4     51
5     48
6     53
7     46
8     53
9     55
10    66
11    66
12    51
13    50
14    60
15    45
16    67
Name: telugu, dtype: int64

In [ ]:
# df["percentage"].max()

In [18]:
df.columns[7]

'social'

In [17]:
print(df)

    htno     name  telugu  english  hindi  maths  science  social
0    100   Ramesh      50       60     66     98       66      55
1    101   Rajesh      45       67     34     67       66      78
2    102   Rossum      56       88     56     99       44      77
3    103     Raji      56       78     34     56       88      55
4    104   Kalyan      51       63     62     93       67      51
5    105  Karthik      48       62     39     68       65      88
6    106   Kambli      53       81     59     92       48      73
7    107  Praveen      46       88     74     86       78      45
8    108   Ganesh      53       62     76     88       76      35
9    109     Nags      55       77     44     77       86      58
10   110    Biswa      66       48     86     95       48      47
11   111   Ritchi      66       68     64     76       98      75
12   104   Kalyan      51       63     62     93       67      51
13   112  shareef      50       63     99     90       76      67
14   113     sonu      60       89     98     87       77      68
15   114   Rajesh      45       67     77     55       66      46
16   115   Rakesh      67       78     88     78       67      49